-- made by { @Mouamle }
do
ws = {}
rs = {}

-- some examples of how to use this :3 
ws[1] = "@superbabeleon_bot" -- msg 
rs[1] = "عيني" -- reply

ws[2] = "شلونك" -- msg
rs[2] = "تمام بحي وانتة " -- reply

ws[3] = "تمام" -- msg
rs[3] = "دووم" -- reply

ws[4] = "ضوجة" -- msg 
rs[4] = "اي خرب وين نروح" -- reply

ws[5] = "اوف" -- msg 
rs[5] = "امشي خلي نروح للديسكو" -- reply

ws[6] = "يلة" -- msg 
rs[6] = "اصبر خل البس الحذاء هههه" -- reply

ws[7] = "معزوفة" -- msg 
rs[7] = "طم طم طح طح روح للكاع" -- reply

ws[8] = "احبج" -- msg 
rs[8] = "احبك واليحب بلوة" -- reply

ws[11] = "احبك" -- msg 
rs[11] = "مبين عليك زاحف نوعية فاخرة" -- reply

ws[12] = "شتكول عل بوتات الجديدة" -- msg 
rs[12] = "طيط بطورين ههه" -- reply

ws[13] = "منو اقوة بوت" -- msg 
rs[13] = "اني طبعن دي دي لحد يوصل" -- reply

ws[14] = "شكاعد تسوي هسة" -- msg 
rs[14] = "والله لازم البطل والجكارة وصك بيهن" -- reply

ws[15] = "شتكول عل زواحف" -- msg 
rs[15] = "والله عمي بس الزواحف يكبلون شايفلك شريف كبل ماكو" -- reply

ws[16] = "اكلك" -- msg 
rs[16] = "كول" -- reply

ws[17] = "بوس الاعضاء" -- msg 
rs[17] = "لا ونعال الحمزة استحي" -- reply

ws[18] = "اني عمر احبك" -- msg 
rs[18] = "اني هم احبك 😍 مح ❤️" -- reply

ws[19] = "شكو ماكو" -- msg 
rs[19] = "غيرك براسي ماكو 💨😽🚬️" -- reply

ws[20] = "تا حسك اجذب" -- msg 
rs[20] = "شايفني كواد 🌚😂️" -- reply

ws[21] = "شخبار صديقتك" -- msg 
rs[21] = "والله 🌚💔 تركتهة ️" -- reply

ws[22] = "ليش ولك تركتهة" -- msg 
rs[22] = "برب زنجرت 😂💔 رب ما بقة براسهة️" -- reply

ws[23] = "اروح اسمع" -- msg 
rs[23] = "شتسمع️" -- reply

ws[24] = "حسين حركة" -- msg 
rs[24] = "هاذ اكبر زاحف 🐍 شفتة بحياتي 😂✌🏿️" -- reply

ws[25] = "شنو رائيك" -- msg 
rs[25] = "بمنو️" -- reply


ws[28] = "مرحبا" -- msg 
rs[28] = "مراحب 🌹 منور/ة 😊️" -- repl

ws[29] = "هلو" -- msg 
rs[29] = "هلوات 🌹 منور/ة 😊️" -- repl

ws[30] = "السلام عليكم" -- msg 
rs[30] = "وعليكم 👋🏿 السلام ورحمة الله 😊🌹" -- rep

ws[31] = "برهم" -- msg 
rs[31] = "عمي هاذ الذيب 🐆 منو يلحكة 😈✋🏿️" -- rep

ws[32] = "محمد" -- msg 
rs[32] = "ههههه هاذ طيز 😂🚶🏿🏿️" -- rep


ws[33] = "كحبه" -- msg 
rs[33] = "وردة 🌹 مال الله ضاغطتهم 😌✋🏿" -- rep

ws[34] = "منو تحب اني لو الحمزه" -- msg 
rs[34] = "😕 دي ثنينكم احب الجكارة والنركيلة 😂✋🏿" -- rep

ws[35] = "نور" -- msg 
rs[35] = "ملكه👑عصره وحمامه 🕊" -- rep

ws[36] = "باي" -- msg 
rs[36] = "بايات 👋🏿 الله وياك/ج وردة 😊🌹" -- rep

ws[37] = "تا حسك ساحف" -- msg 
rs[37] = "اي والله 😁 اسحف علة ابوية اريد فلوس 🐼💔" -- rep

ws[38] = "تسلم" -- msg 
rs[38] = "ادلل حبي 😘🌹" -- rep

ws[38] = "تحبني" -- msg 
rs[38] = "اي" -- rep

ws[39] = "شكد" -- msg 
rs[39] = "اكثر مما تصور 🙊❤️" -- rep

ws[40] = "كلي حباب" -- msg 
rs[40] = "صفر 🙈 😂🚶🏿" -- repy

ws[41] = "ذاري" -- msg 
rs[41] = "بربك صدك تحجي شايفلك طيز مات" -- repy

ws[42] = "والله بواهسي اروح للزوراء" -- msg 
rs[42] = "ليش" -- repy

ws[41] = "اغير جو" -- msg 
rs[41] = "😂 تغير جو لو تسحف 🐍 عل بنات" -- repy

ws[42] = "هلاو" -- msg 
rs[42] =  "هلاوو99وووات نورت/ي ❤️🙈" -- reply

ws[43] = "@lock_at_me_now" -- msg
rs[43] = "هذا الي صنعني فديت ربه 🙈❤️" -- reply

ws[44] = "شلونكم" -- msg
rs[44] = "اني بالنسبة اليه دايح شوف بقيه الاعضااء 😂🖕" -- reply

ws[45] = "ضوجة" -- msg 
rs[45] = "شي اكيد الكبل ماكو 😂 لو بعدك/ج مازاحف/ة 🙊😋" -- reply

ws[46] = "شدكول انيجه" -- msg 
rs[46] = "انته شدكول اجي اساعدك ارفعلك رجلهـ|ا 😍🤘🏼" -- reply

ws[47] = "ضوجه كلش" -- msg 
rs[47] = "تعالـ|ـي نفتح ديسكو والربح بالنص 😉🌝❤️" --reply

ws[48] = "صباح الخير" -- msg 
rs[48] = "😍هله صباح النور صباح العسل 🌝❤️ فديتكـ|ـج" --reply

ws[49] = "مساء الخير" -- msg 
rs[49] = "مساء النور والطيبه مساء العسل يا عسل 😍👌🏼" --reply

ws[50] = "صدك" -- msg 
rs[50] = "يابه قابل مجذبين عليكـ|ـج احنه 🌚💔" --reply

ws[51] = "باي" -- msg 
rs[51] = "دروحـ|ـي لطشتـ|ـي 😒🖕🏽" --reply

ws[52] = "احبك" -- msg 
rs[52] = "😍 اموت ع الي خلقكـ|ـج" --reply

ws[53] = "يابه" -- msg 
rs[53] = "يابه ابيش اللعابه 🌝🐾" --reply

ws[54] = "نورت" -- msg 
rs[54] = "🌝🍾بنور @lock_at_me_now  لك فديت ربك 😍👌🏼"🏼 --reply

ws[55] = "نورتي" -- msg 
rs[55] = "نورتي بنور @lock_at_me_now  لك فديت ربك 😍👌🏼" --reply

ws[56] = "كسمك" -- msg 
rs[56] = "😍 لك غير الحسه لحس الكسمك💋😚" --reply

ws[57] = "برهم" -- msg 
rs[57] = "لك غير اموت عليه غير اتخبل عليه هوه النفس والريه الي يجي يمه 😐👊🏼 #اطكطكه احذرو التقرب⚠️ #بيس 🤕🤘🏼" --reply

ws[58] = "اريد كروب" -- msg 
rs[58] = "تعال هنا وخذ كروبك: @lock_at_me_now 🌝🍾" --reply



-- the main function
function run( msg, matches )
	-- just a local variables that i used in my algorithm  
	local i = 0; local w = false

	-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
	-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
	for k,v in pairs(ws) do
		-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
		if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
			-- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
			i = k; w = true;
		end
	end

	-- check if { w } is not false and { i } not equals to 0
	if ( (w ~= false) and (i ~= 0) ) then
		-- get the receiver :3 
		R = get_receiver(msg)
		-- send him the proper message from the index that { i } assigned to
		send_large_msg ( R , rs[i] );
	end
	
	-- don't edit this section
	if ( msg.text == "about" ) then
		if ( msg.from.username == "Mouamle" ) then
			R = get_receiver(msg)
			send_large_msg ( R , "Made by @Mouamle" );
		end
	end 

end



return {
	patterns = {
		"(.*)"		
  	},
  	run = run
} 


end